Tekla Open API Reference for Tekla Structures 2025
String.Equality Operator
 Compares a string value with a Datatype.String value.
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator ==(
	string Left,
	String Right
)
Public Shared Operator = (
	Left As String,
	Right As String
) As Boolean
Parameters
Left
Type: System.String
The string value to be compared.
Right
Type: Tekla.Structures.Datatype.String
The Datatype.String value to be compared.
Return Value
Type: Boolean
True if the values are the same.
See Also
Reference
String Structure
Tekla.Structures.Datatype Namespace